{
  "dosha": "vata",
  "description": "Vata represents the air element, which creates movement and rhythm. It governs the process of walking, breathing, intake of food, transporting nutrients, eliminating waste, etc. It is the force that moves things around. Excess Vata in the body often results in an erratic heartbeat, poor breathing, pain, gas, etc. Emotionally it can make us anxious, fearful, and restless. Essentially, our thoughts overtake us like a whirlwind.",
  "howToPerformYoga": [
    "You should warm up well to improve circulation, if your body tend to be stiff in the mornings and during the winter.",
    "Your Dosha(functional energies in body) type needs warmth, and therefore should practice in a comfortable room that is not cold or damp. If your body is stiff in the very early hours of the morning, the good time to practice yoga is between sunrise and 10:00 am."
  ],
  "yoga": [
    {
      "yogaName": "Uttanasana(Standing forward bend)",
      "steps": [
        "In Uttanasana, your head is below your heart. This allows the unusual occasion for blood to rush to your head (rather than your feet), giving your cells a rejuvenating boost of oxygen.",
        "Stand straight with legs and feet together, spine should be erect, chest slightly lifted and hands to the side of the body(known as Mountain Pose).Relax the body in this pose taking a few deep breaths.",
        "Bend your knees slightly and fold your torso over your legs, moving from the hips, not the lower back.",
        "Place your hands next to your feet or on the ground in front of you.",
        "Inhale and extend your chest to lengthen your spine. Keep your gaze directed forward.",
        "Exhale and gently press both legs toward straight. Lift the kneecaps and gently spiral your upper, inner thighs back. Keep your legs straight without hyperextending.",
        "On an exhalation, extend your torso down without rounding your back. Stay long throughout your neck, extending the crown of your head toward the ground. Draw your shoulders down your back."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/uttasana.jpeg"
      ],
      "mistakesToAvoid": [
        "DON’T round your upper back and roll your shoulders forward",
        "DON’T lock your knees and round your lower back",
        "Make sure your fold originates from your pelvis, deepening the hip creases, and not from the back. A fold that comes from the back will result in a curved spine that hangs over your legs. "
      ]
    },
    {
      "yogaName": "Paschimottanasana(Seated Forward Bend, or Intense Dorsal Stretch)",
      "steps": [
        "Seated Forward Bend is extending the top half of the body over the seated lower half helps stretch the entire back of body to enhance physical flexibility. Folding inward in this way also brings mental calm.",
        "Spread the legs forward and sit on the ground.",
        "Touch the thumbs of the feet with the hands, slowly breathe out and try to place the head on the knees.",
        "Then slowly raise the head and come back to initial position. Repeat this Aasan for 10-15 times daily."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/paschimotsana.jpeg"
      ],
      "mistakesToAvoid": [
        "Keep your knees aligned and do not allow them to turn out. If that happens, it lessens the stretch of of your hamstrings and puts the stress closer to your joints.",
        "Keep your back straight for as long as you can in the pose. This will help you get full breaths."
      ]
    },
    {
      "yogaName": "Balasana(Child's Pose, or Child's Resting Pose)",
      "steps": [
        "Child's Pose(Balansana) is yoga's most important resting posture and it is a nice way to gently stretch various parts of your body.",
        "Sit on your heels, knees spread mat distance apart and bring your head towards the floor",
        "Your arms can be either stretched out to the front, by your side or hands underneath your forehead",
        "Breathe into your lower back",
        "Stay for anywhere between 30 seconds and several minutes in this resting pose",
        "To come out, exhale and roll up vertebra by vertebra, or come back to sitting with a straight spine."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/balasana.jpeg"
      ],
      "mistakesToAvoid": [
        "Your neck should stay in neutral position. If you find you are bending your neck, use a pillow, yoga block, or another prop to keep pressure off your neck.",
        "If you are suffering from diarrhoea, then avoid yoga before sleep as it massages the digestive tract and creates pressure on the bowels.",
        "If you have injuries in your legs or knee problems or hypertension, then refrain from getting into this asana."
      ]
    },
    {
      "yogaName": "Supta Virasana(Reclining Hero Pose)",
      "steps": [
        "First kneel and then sit back on your legs to take the weight off your knee(known as Vajrasana) on the mat.",
        "Stand on your knees and bring them closer to spread your feet wide apart.",
        "Turn your calves outwards using your hands and place your buttocks in between the heels.",
        "It’s Virasana posture(Hero Pose).Press your elbows to the floor, exhale, and start leaning back.",
        "Bring your hands to your heels and lie down on your back.",
        "Inhale and raise your arms and extend them overhead with the palms facing upwards.",
        "Keep breathing and stay in the pose for 30-60 seconds.",
        "Inhale and bring your arms backs to the heels.By pressing the elbows, come back up.",
        "Bring your hands to your knees.Stand on your knees and bring the feet together.Sit in Virasana and relax."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/supta_virasana.jpeg"
      ],
      "mistakesToAvoid": [
        "As with Hero Pose, keeping aligned is very important. As you lean back, the knees have a tendency to want to separate. Monitor this and make sure they stay together, even if it means your back doesn't make it all the way down to the floor.",
        "Avoid practicing supta virasana if you have issues with the back, knee, or ankle or have Angina.",
        "Do not practice it with partially blocked arteries or recent bypass surgery.",
        "Discontinue practicing supta virasana if you feel pain in sitting on the virasana",
        "Do not spread your feet wider than the hips",
        "Always perform the asana on empty stomach."
      ]
    },
    {
      "yogaName": "Dhanurasana(The Bow Pose)",
      "steps": [
        "This is a yoga pose that stretches your whole body and makes it flexible as well as fit.",
        "Lie down in prone position; facing your chest downwards and your back upwards.",
        "Now relax your body and exhale deeply.",
        "While you’re exhaling, bend your knees and bring your both heel as close to your hips as possible.",
        "Then raise your chin and bend your head and neck backward. Your chest should still be touching the ground.",
        "Now inhale slowly and pull your legs upwards.Keep raising your head, neck, chin, chest, thighs, and knees backward and keep only the navel region touching the ground.",
        "Balance your body in the navel region.Stay in this pose from 20 to 30 seconds.",
        "Now, release your body as you exhale, and lay down to take some breath."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/dhanurasana.jpeg"
      ],
      "mistakesToAvoid": [
        "Avoid doing Bow pose right before going to bed; it might cause problems in sleeping.",
        "People with heart problems or high blood pressure should not do Dhanurasana.",
        "People with severe backache should not do it without consultation.",
        "It should be done on an empty stomach or at least after 3 hours of a meal.",
        "Don’t Hold the Tops of Your Feet and Keep Your Knees Hip-width",
        "Rotate the Shoulder Socket Carefully, Don’t Hold Your Breath and Release the Pose Safely"
      ]
    },
    {
      "yogaName": "Ustrasana(Camel Pose)",
      "steps": [
        "In the camel pose, as in many backbends, that means anchoring through the pelvis and legs with the proper alignment, and then inviting the upper back, chest, and shoulders to open and welcome the flood of life-giving energy flowing up the central core of the body. ",
        "Start with kneeling down on the floor.",
        "Keep your thighs and feet together.Toes should be pointing back and resting on the floor.",
        "Bring the knees and the feet about one foot apart and stand on the knees.Inhale, bend backward slowly.",
        "Exhale, place the right palm on the right heel and left palm on the left heel.",
        "The thighs should be vertical to the floor and the head tilted backward.",
        "The weight of the body should be evenly supported by the arms and legs.",
        "Maintain the pose as long as you can.Exhale, come to the original position slowly."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/Ustrasana.jpeg"
      ],
      "mistakesToAvoid": [
        "One of the most common problems in camel is keeping the thighs upright. As you take the chest back, you want to make sure that your thighs are not following it and ending up slanting back instead of staying fully vertical. To check if this is happening, take your pose over to a wall. Set up with the front of your thighs on the wall. As you reach back, make sure that your thighs and even your hip points stay in contact with the wall the whole time.",
        "Persons with severe back problems such as lumbago should strictly avoid it.",
        "Avoid, if having enlarged thyroid.",
        "Those suffering from heart disease and hernia should avoid it.",
        "It should be skipped both in case of high or low blood pressure.",
        "Avoid in back or neck injury"
      ]
    },
    {
      "yogaName": "Surya Namaskar(Sun Salutation)",
      "steps": [
        "Surya Namaskar or Sun Salutation is a sequence of 12 powerful yoga poses. Besides being a great cardiovascular workout, Surya Namaskar is also known to have an immensely positive impact on the body and mind.Practicing Surya Namaskar steps is best done early morning on an empty stomach.",
        "Step 1. Pranamasana (Prayer pose) \n Stand at the edge of your mat, keep your feet together and balance your weight equally on both feet. Expand your chest and relax your shoulders. As you breathe in, lift both arms up from the sides, and as you exhale, bring your palms together in front of the chest in a prayer position.",
        "Step 2. Hastauttanasana (Raised arms pose) \n Breathing in, lift the arms up and back, keeping the biceps close to the ears. In this pose, the effort is to stretch the whole body up from the heels to the tips of the fingers.",
        "Step 3. Hastapadasana (Standing forward bend) \n Breathing out, bend forward from the waist keeping the spine erect. As you exhale completely, bring the hands down to the floor beside the feet.",
        "Step 4. Ashwa Sanchalanasana (Equestrian pose) \n Breathing in, push your right leg back, as far back as possible. Bring the right knee to the floor and look up.",
        "Step 5. Dandasana (Stick pose) \n As you breathe in, take the left leg back and bring the whole body in a straight line.",
        "Step 6. Ashtanga Namaskara (Salute with eight parts or points) \n Gently bring your knees down to the floor and exhale. Take the hips back slightly, slide forward, rest your chest and chin on the floor. Raise your posterior a little bit. The two hands, two feet, two knees, chest and chin (eight parts of the body) should touch the floor.",
        "Step 7. Bhujangasana (Cobra pose) \n Slide forward and raise the chest up into the Cobra pose. You may keep your elbows bent in this pose with the shoulders away from the ears. Look up at the ceiling.",
        "Step 8. Adho Mukha Svanasana (Downward facing dog pose) Breathing out, lift the hips and the tailbone up to bring the body into an inverted ‘V’ pose.",
        "Step 9. Ashwa Sanchalanasana (Equestrian pose) \n  Breathing in, bring the right foot forward in between the two hands. The left knee goes down on the floor. Press the hips down and look up.",
        "Step 10. Hastapadasana (Standing forward bend) \n Breathing out, bring the left foot forward. Keep the palms on the floor. You may bend the knees, if necessary.",
        "Step 11. Hastauttanasana (Raised arms pose) \n Breathing in, roll the spine up. Raise the hands up and bend backward a little bit, pushing the hips slightly outward.",
        "Step 12. Tadasana (Mountain Pose) \n As you exhale, first straighten the body, then bring the arms down. Relax in this position and observe the sensations in your body.",
        "This completes one set of Surya Namaskar. Complete the round by repeating the steps. Only this time, start with taking the left foot behind in step number 4 and bringing the right foot forward in step number 10. Once done, you would’ve completed one round of Surya Namaskar."
      ],
      "image": [
        "https://healthandjiva.s3.ap-south-1.amazonaws.com/yoga/vata/surya_namaskar.jpeg"
      ],
      "mistakesToAvoid": [
        "Before commencing into surya namaskar practice, include light stretches, head, shoulders, wrists, knees, and hips rotation into your warm-up routine to enhance the range of motion and lubricate the major joints of the body.",
        "The breathing sequence of Surya namaskar is a must in order to get most of its fruitful benefits. The sequence usually starts with one deep inhale and exhale in standing tadasana, then each pose of the series is followed in the inhale-exhale cycle. In the end, the sequence ends at exhalation in standing tadasana position.",
        "The spine should be entirely engaged throughout the complete Surya namaskar sequence and it is inevitable to maintain spinal integrity. However, in poses like plank beginners usually attain improper spinal alignment by dropping the lower spine to the floor. This incorrect alignment of the spine to attain the plank leads to lower back pain.",
        "While transitioning from Downward-facing dog pose to the low lunge, it’s challenging to bring the foot forward between the hands without hyperextending the knees.For this, one must first drop the knees first before stepping the foot forward to be placed between the hands.",
        "Therefore, try to perform two rounds of Surya Namaskar on alternate day s and gradually increase to 2 rounds per day. Then, further, increase your sets keeping 12 rounds every day the ultimate goal.",
        "It is important to complete the first round of Surya Namaskar before stepping towards the second one, otherwise an incomplete cycle is considered insignificant.",
        "Avoid the fear of losing the momentum and take breaks whenever needed. Reaching the floor to relax in the child pose or breathing deeply to gain strength in the down dog pose is recommended.",
        "For an effective Surya Namaskar practice, full mind-body awareness is a must.To avoid this mistake, best way is to chant to respective mantra for each pose and focus on the breath while transitioning between the poses."
      ]
    }
  ]
}
